from openpyxl import Workbook
def write_excel():
    wb = Workbook()
    ws = wb.active
    #ws.title = "提单对账数据3万"
    #row = ["客户代码	","账户类型","付款账号","付款方","收款账号","收款金额","币种","汇率","收款时间","收款网点","结算模式","备注"]
    #row = ["客户代码	", "账户类型", "付款账号", "付款方", "收款账号", "收款金额", "币种", "汇率", "收款时间", "收款网点", "结算模式", "备注"]
    '''[收款单管理]批量导入收款金额表头'''
    # tidan_row = ['服务商代码*',	'提单号*',	'总金额*',	'币种*','箱数*',	'票数*',	'重量*'	,'材积重*',	'海关编码*',	'清关费*	','机场操作费*',	'提货费*	','其他费用*	','清关口岸'	,'清关完成时间'	,'备注']
    #       ["test1015",	"YT1900301106000002",	"123-20181205",	"59",	"237",	"RMB",	"4"],
    '''[批量签入签出导入文件头]'''
    row = ["单号","单号类型","袋牌号","到货时间","长(cm)","宽(cm)","高(cm)","重量(kg)","锁定产品","使用客户重量(是/否)"]
    ws.append(row)
    ws.append(["TEST1017","" ,"","", "16,059.28", "RMB", "1000", "11", "1000000", "238.2", "0", "0", "16,059.28"])
    tidan = "123-20181205"
    j = 0
    a = 1000
    b = 2000
    c = 3000
    for i in range(3000):

        # ws.append(["test1015",	"YT"+str(1900301106000002+i+1),	"123-20181205",	"59",	"237",	"RMB",	"4"])
        # ws.append(['yif'	,'110-' + str(20190122 + i +1),	'1000',	'RMB',	1,	1,	100,	500,	1,	1000,	1,	2,	3,	'AFH',	'2019/2/20 14:02',	'123'])
        print(datetime.now(), i)
        if i % 1000 == 0:
            j = j + 1
            tidan = '123-' + str(20181205 + j)
            print(datetime.now(), i)
        if i>=0 and i <=a:
            #ws.append(["100010", "人民币","132","yif","前海云途公账支付宝", i + 1, "RMB", "7.5689", "2019/3/13 15:56","云途通运物流深圳总公司","快递费", "3000条导入"])
            ws.append(["TEST1017","111-2019"+str(i),"16,059.28","RMB","1000","11","1000000","238.2","0","0","16,059.28"])
        elif i > a and i <= b:
            ws.append(["TEST1017","111-2019"+str(i),"16,059.28","RMB","1000","11","1000000","238.2","0","0","16,059.28"])
        elif i > b and i <= c:
            ws.append(["TEST1017","111-2019"+str(i),"16,059.28","RMB","1000","11","1000000","238.2","0","0","16,059.28"])
            #["7291", "人民币", "132", "yif", "魅族银行账号", i + 1,"EUR", "7.5689","2019/3/13 15:56", "云途通运物流深圳总公司", "快递费", "3000条导入"]
    # wb.create_sheet("清关vat对账数据20万",index=1)

    wb.save("C:\\Users\\Administrator\\Desktop\\中转对账3000.xls")